Revit 2024 API
PerformanceAdviser.AddRule Method
 Adds a performance adviser rule to the list of rules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void AddRule(
	PerformanceAdviserRuleId id,
	IPerformanceAdviserRule rule
)
Visual Basic
Public Sub AddRule ( _
	id As PerformanceAdviserRuleId, _
	rule As IPerformanceAdviserRule _
)
Visual C++
public:
void AddRule(
	PerformanceAdviserRuleId^ id,
	IPerformanceAdviserRule^ rule
)
Parameters
id
Type: Autodesk.Revit.DB.PerformanceAdviserRuleId
 An id of the rule to be added to the list of rules.
rule
Type: Autodesk.Revit.DB.IPerformanceAdviserRule
 The rule to be added
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PerformanceAdviser Class
Autodesk.Revit.DB Namespace